ИС_СПОРТ_2022/src/InformationRegisters/ОценкиПрохожденияНормативов/ОценкиПрохожденияНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиПрохожденияНормативов</name>
  <resources>
    <name>РезультатЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипПодсчетаРезультата</name>
    <type>
      <types>EnumRef.ТипПодсчетаРезультата</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ТипыСдачиНормативов/ТипыСдачиНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСдачиНормативов</name>
  <enumValues>
    <name>Норматив</name>
  </enumValues>
  <enumValues>
    <name>Соревнование</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ТипыРезультатов/ТипыРезультатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРезультатов</name>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ТипПодсчетаРезультата/ТипПодсчетаРезультата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПодсчетаРезультата</name>
  <enumValues>
    <name>СуммаПопыток</name>
  </enumValues>
  <enumValues>
    <name>МинимальноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>МаксимальноеЗначение</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/CommonModules/ОФППодсчетРезультатовВыполненияНормативовСервер/Module.bsl
#Область РасчетМестОчковБалловПоТипуСоревнования

Процедура ПересчитатьМестаИБаллыНаСервере(Параметры) Экспорт
	
	СоставУчастников = Параметры.СоставУчастников;
	
	ТипСоревнования = Параметры.ТипСоревнования;
	
	Если ТипСоревнования = Перечисления.ТипыСдачиНормативов.Соревнование Тогда
		РассчитатьНабранныеОчкиПоСоревнованиюОФП(СоставУчастников);
	Иначе
		РассчитатьНабранныеБаллыПоНормативамОФП(СоставУчастников);
	КонецЕсли;	
		
КонецПроцедуры

Процедура РассчитатьНабранныеОчкиПоСоревнованиюОФП(СоставУчастников)
	
	таблицаНормативов = СоставУчастников.Скопировать();
	таблицаНормативов.Свернуть("Норматив,ТипПодсчетаРезультата,ТипРезультата");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("таблицаСоставУчастников", СоставУчастников);
	
	ТекстЗапроса = "";
	
	Для Индекс = 0 По таблицаНормативов.Количество()-1 Цикл 
		
		Запрос.УстановитьПараметр("Норматив_"+Индекс, таблицаНормативов[Индекс].Норматив);
		Запрос.УстановитьПараметр("ТипРезультата_"+Индекс, таблицаНормативов[Индекс].ТипРезультата);
		Запрос.УстановитьПараметр("ТипПодсчетаРезультата_"+Индекс, таблицаНормативов[Индекс].ТипПодсчетаРезультата);
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС;
		// {Рарус adilas #- -Sonar 2021.06.29
		УчетСпортсменовВызовСервера.ВвестиСтруктуруВоВременнуюТаблицу(
		    ТекстЗапроса,
		    Новый Структура("Индекс, МеждународнаяВозрастнаяГруппа, Пол, ТипПодсчетаРезультата, ТипРезультата, Норматив, РезультатБулево, РезультатЧисло"),
			"вт_ТаблицаПоНормативам_"+Индекс,
			"таблицаСоставУчастников");
		
		ТекстЗапроса = ТекстЗапроса + " 
						               |ГДЕ
						               |	таблицаСоставУчастников.Норматив = &Норматив_"+Индекс+"
						               |	И таблицаСоставУчастников.ТипРезультата = &ТипРезультата_"+Индекс+"
						               |	И таблицаСоставУчастников.ТипПодсчетаРезультата = &ТипПодсчетаРезультата_"+Индекс+"
									   |    И ВЫБОР КОГДА таблицаСоставУчастников.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.ТипыРезультатов.Время)
									   |        ИЛИ таблицаСоставУчастников.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.ТипыРезультатов.Число)
									   |         ИЛИ таблицаСоставУчастников.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.ТипыРезультатов.ПустаяСсылка) ТОГДА
									   |           таблицаСоставУчастников.РезультатЧисло <> 0 
									   |      ИНАЧЕ Истина
									   |      КОНЕЦ
						               |;
						               |
						               |////////////////////////////////////////////////////////////////////////////////
						               |ВЫБРАТЬ
						               |	вт_ТаблицаПоНормативам_"+Индекс+".Индекс КАК Индекс,
						               |	вт_ТаблицаПоНормативам_"+Индекс+".МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
						               |	вт_ТаблицаПоНормативам_"+Индекс+".Пол КАК Пол,
						               |	вт_ТаблицаПоНормативам_"+Индекс+".ТипРезультата КАК ТипРезультата,
									   |	вт_ТаблицаПоНормативам_"+Индекс+".ТипПодсчетаРезультата КАК ТипПодсчетаРезультата,
						               |	вт_ТаблицаПоНормативам_"+Индекс+".Норматив КАК Норматив,
									   |	вт_ТаблицаПоНормативам_"+Индекс+".РезультатЧисло КАК РезультатЧисло,
						               |	вт_ТаблицаПоНормативам_"+Индекс+".РезультатБулево КАК РезультатБулево
						               |ИЗ
						               |	вт_ТаблицаПоНормативам_"+Индекс+" КАК вт_ТаблицаПоНормативам_"+Индекс+"
						               |
						               |%1 %2
						               |ИТОГИ ПО                                                             
						               |	ТипРезультата,
									   |    ТипПодсчетаРезультата,
						               |	МеждународнаяВозрастнаяГруппа,
						               |	Пол" + ?(Индекс = таблицаНормативов.Количество()-1, "", ";");
		
		типБулево = Перечисления.ТипыРезультатов.Булево;
		
		Если таблицаНормативов[Индекс].ТипРезультата = типБулево Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%1", "УПОРЯДОЧИТЬ ПО РезультатБулево ");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%1", "УПОРЯДОЧИТЬ ПО РезультатЧисло ");
		КонецЕсли;
		
		Если таблицаНормативов[Индекс].ТипПодсчетаРезультата = Перечисления.ТипПодсчетаРезультата.МинимальноеЗначение Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%2", "Возр");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%2", "Убыв");
		КонецЕсли;
		  	 		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыбиратьСМинимальногоЗначения = Перечисления.ТипПодсчетаРезультата.МинимальноеЗначение;
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Для ИндексПакета = 0 По Пакет.Количество()-1 Цикл
		
		Если ИндексПакета >= Пакет.Количество()-1 Тогда
			Прервать;
		ИначеЕсли (ИндексПакета + 1)%2 = 0 Тогда
			Продолжить;
		Иначе
			выборкаТипРезультата = Пакет[ИндексПакета+1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока выборкаТипРезультата.Следующий() Цикл
				ТипРезультата = выборкаТипРезультата.ТипРезультата;
				
				выборкаТипПодсчетаРезультата = выборкаТипРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока выборкаТипПодсчетаРезультата.Следующий() Цикл
					
					ТипПодсчетаРезультата = выборкаТипПодсчетаРезультата.ТипПодсчетаРезультата;
					
					ВыборкаГруппа = выборкаТипПодсчетаРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаГруппа.Следующий() Цикл
						
						ВыборкаПол = ВыборкаГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);						
						Пока ВыборкаПол.Следующий() Цикл
							
							МаксимальноеЗначение = 9999;
							МинимальноеЗначение  = 0.001;
							Место                = 0;
							ПозицияМеста         = 1;
							
							Индекс = 0;
							
							Выборка = ВыборкаПол.Выбрать();
							Пока Выборка.Следующий() Цикл
								
								Если ТипРезультата = типБулево Тогда
									
									Если ТипПодсчетаРезультата = ВыбиратьСМинимальногоЗначения Тогда
										Если НЕ Выборка.РезультатБулево Тогда
											СоставУчастников[Выборка.Индекс].Место = 1;
											СоставУчастников[Выборка.Индекс].Очки = 1;
										Иначе
											СоставУчастников[Выборка.Индекс].Место = 2;
											СоставУчастников[Выборка.Индекс].Очки = 2;
										КонецЕсли;	
									Иначе
										Если Выборка.РезультатБулево Тогда
											СоставУчастников[Выборка.Индекс].Место = 1;
											СоставУчастников[Выборка.Индекс].Очки = 1;
										Иначе
											СоставУчастников[Выборка.Индекс].Место = 2;
											СоставУчастников[Выборка.Индекс].Очки = 2;
										КонецЕсли;
									КонецЕсли;
									
								Иначе
									
									Если ТипПодсчетаРезультата = ВыбиратьСМинимальногоЗначения Тогда
										
										Если Индекс = 0 Тогда
										    МинимальноеЗначение = Выборка.РезультатЧисло;
											СоставУчастников[Выборка.Индекс].Место = 1;
											СоставУчастников[Выборка.Индекс].Очки = 1;
											Место = Место + 1;
										ИначеЕсли Выборка.РезультатЧисло > МинимальноеЗначение Тогда
											МинимальноеЗначение = Выборка.РезультатЧисло;
											Место =  Индекс + 1;
											СоставУчастников[Выборка.Индекс].Место = Место;
											СоставУчастников[Выборка.Индекс].Очки = Место;
										Иначе
											СоставУчастников[Выборка.Индекс].Место = Место;
											СоставУчастников[Выборка.Индекс].Очки = Место;
										КонецЕсли;
										Индекс = Индекс + 1;
										
									Иначе
										
										Если Выборка.РезультатЧисло < МаксимальноеЗначение Тогда
											МаксимальноеЗначение = Выборка.РезультатЧисло;
											Место =  Индекс + 1;
											СоставУчастников[Выборка.Индекс].Место = Место;
											СоставУчастников[Выборка.Индекс].Очки = Место;
										Иначе
											СоставУчастников[Выборка.Индекс].Место = Место;
											СоставУчастников[Выборка.Индекс].Очки = Место;
										КонецЕсли;
										Индекс = Индекс + 1;
										
									КонецЕсли;	
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЦикла;	
						
					КонецЦикла;	
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	//+++astyul, пока закомментируем. оставим механизм место = балл
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("таблицаДанных", СоставУчастников);
	//
	//ТекстЗапроса = "";
	//УчетСпортсменовСлужебный.ВвестиСтруктуруВоВременнуюТаблицу(
	//ТекстЗапроса, 
	//Новый Структура("Индекс, МеждународнаяВозрастнаяГруппа, Пол, Норматив, Место"),
	//"вт_ДанныеПоДокументу",
	//"таблицаДанных");
	//
	//Запрос.Текст = ТекстЗапроса + "
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	вт_ДанныеПоДокументу.Индекс КАК Индекс,
	//               |	вт_ДанныеПоДокументу.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	//               |	вт_ДанныеПоДокументу.Пол КАК Пол,
	//               |	вт_ДанныеПоДокументу.Норматив КАК Норматив,
	//               |	вт_ДанныеПоДокументу.Место КАК Место,
	//               |	МАКСИМУМ(ШкалаСоответствияОчковРезультатовСоревнованияОФП.Очки) КАК Очки
	//               |ИЗ
	//               |	вт_ДанныеПоДокументу КАК вт_ДанныеПоДокументу
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСоответствияОчковРезультатовСоревнованияОФП КАК ШкалаСоответствияОчковРезультатовСоревнованияОФП
	//               |		ПО вт_ДанныеПоДокументу.МеждународнаяВозрастнаяГруппа = ШкалаСоответствияОчковРезультатовСоревнованияОФП.МеждународнаяВозрастнаяГруппа
	//               |			И вт_ДанныеПоДокументу.Пол = ШкалаСоответствияОчковРезультатовСоревнованияОФП.Пол
	//               |			И вт_ДанныеПоДокументу.Норматив = ШкалаСоответствияОчковРезультатовСоревнованияОФП.Норматив
	//               |			И вт_ДанныеПоДокументу.Место = ШкалаСоответствияОчковРезультатовСоревнованияОФП.Место
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	вт_ДанныеПоДокументу.Индекс,
	//               |	вт_ДанныеПоДокументу.МеждународнаяВозрастнаяГруппа,
	//               |	вт_ДанныеПоДокументу.Пол,
	//               |	вт_ДанныеПоДокументу.Норматив,
	//               |	вт_ДанныеПоДокументу.Место";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СоставУчастников[Выборка.Индекс].Очки = Выборка.Очки;
	//КонецЦикла;	
	
КонецПроцедуры	

Процедура РассчитатьНабранныеБаллыПоНормативамОФП(СоставУчастников)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("таблицаДанных", СоставУчастников);
	
	ТекстЗапроса = "";
	// {Рарус adilas #- -Sonar 2021.06.29
	УчетСпортсменовВызовСервера.ВвестиСтруктуруВоВременнуюТаблицу(
	ТекстЗапроса, 
	Новый Структура("Индекс, МеждународнаяВозрастнаяГруппа, Пол, Норматив, Место, Баллы, РезультатБулево, РезультатЧисло, ТипРезультата"),
	"вт_ТаблицаДанных",
	"таблицаДанных");
	
	Запрос.Текст = ТекстЗапроса + "
	               |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ОценкиПрохожденияНормативовНижняяГраница.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Пол КАК Пол,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Норматив КАК Норматив,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Балл КАК Балл,
				   |	ОценкиПрохожденияНормативовНижняяГраница.РезультатЧисло КАК РезультатМин,
				   |	МИНИМУМ(ОценкиПрохожденияНормативовВерхняяГраница.РезультатЧисло) КАК РезультатМакс
				   |ПОМЕСТИТЬ ВТ_ШкалаПрисвоенияБаллов
				   |ИЗ
				   |	РегистрСведений.ОценкиПрохожденияНормативов КАК ОценкиПрохожденияНормативовНижняяГраница
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПрохожденияНормативов КАК ОценкиПрохожденияНормативовВерхняяГраница
				   |		ПО ОценкиПрохожденияНормативовНижняяГраница.МеждународнаяВозрастнаяГруппа = ОценкиПрохожденияНормативовВерхняяГраница.МеждународнаяВозрастнаяГруппа
				   |			И (ОценкиПрохожденияНормативовВерхняяГраница.Пол = ОценкиПрохожденияНормативовНижняяГраница.Пол)
				   |			И (ОценкиПрохожденияНормативовВерхняяГраница.Норматив = ОценкиПрохожденияНормативовНижняяГраница.Норматив)
				   |			И ОценкиПрохожденияНормативовНижняяГраница.РезультатЧисло < ОценкиПрохожденияНормативовВерхняяГраница.РезультатЧисло
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Нормативы КАК Нормативы
				   |		ПО ОценкиПрохожденияНормативовНижняяГраница.Норматив = Нормативы.Ссылка
				   |ГДЕ
				   |	(Нормативы.ТипРезультата = ЗНАЧЕНИЕ(перечисление.ТипыРезультатов.число)
				   |			ИЛИ Нормативы.ТипРезультата = ЗНАЧЕНИЕ(перечисление.ТипыРезультатов.время))
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ОценкиПрохожденияНормативовНижняяГраница.МеждународнаяВозрастнаяГруппа,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Пол,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Норматив,
				   |	ОценкиПрохожденияНормативовНижняяГраница.Балл,
				   |	ОценкиПрохожденияНормативовНижняяГраница.РезультатЧисло
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	МеждународнаяВозрастнаяГруппа,
				   |	Пол,
				   |	Норматив
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_ШкалаПрисвоенияБаллов.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
				   |	ВТ_ШкалаПрисвоенияБаллов.Пол КАК Пол,
				   |	ВТ_ШкалаПрисвоенияБаллов.Норматив КАК Норматив,
				   |	ВТ_ШкалаПрисвоенияБаллов.Балл КАК Балл,
				   |	ВТ_ШкалаПрисвоенияБаллов.РезультатМин КАК РезультатМин,
				   |	ЕСТЬNULL(ВТ_ШкалаПрисвоенияБаллов.РезультатМакс, 9999999999) КАК РезультатМакс
				   |ПОМЕСТИТЬ ВТ_ШкалаПрисвоенияБалловПредитог
				   |ИЗ
				   |	ВТ_ШкалаПрисвоенияБаллов КАК ВТ_ШкалаПрисвоенияБаллов
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	МеждународнаяВозрастнаяГруппа,
				   |	Пол,
				   |	Норматив
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Пол КАК Пол,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Норматив КАК Норматив,
				   |	МИНИМУМ(ВТ_ШкалаПрисвоенияБалловПредитог.РезультатМин) КАК РезультатМакс,
				   |	0 КАК РезультатМин
				   |ПОМЕСТИТЬ ВТ_ПрерасчетМинимальногоЗначения
				   |ИЗ
				   |	ВТ_ШкалаПрисвоенияБалловПредитог КАК ВТ_ШкалаПрисвоенияБалловПредитог
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.МеждународнаяВозрастнаяГруппа,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Пол,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Норматив
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	МеждународнаяВозрастнаяГруппа,
				   |	Пол,
				   |	Норматив
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_ПрерасчетМинимальногоЗначения.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
				   |	ВТ_ПрерасчетМинимальногоЗначения.Пол КАК Пол,
				   |	ВТ_ПрерасчетМинимальногоЗначения.Норматив КАК Норматив,
				   |	ВТ_ПрерасчетМинимальногоЗначения.РезультатМакс КАК РезультатМакс,
				   |	ВТ_ПрерасчетМинимальногоЗначения.РезультатМин КАК РезультатМин,
				   |	ВЫБОР КОГДА ВТ_ПрерасчетМинимальногоЗначения.РезультатМин = 0 
				   |       ТОГДА 0  
				   |    ИНАЧЕ ОценкиПрохожденияНормативов.Балл
				   |    КОНЕЦ КАК Балл
				   |ПОМЕСТИТЬ ВТ_ШкалаПрисвоенияБалловИтог
				   |ИЗ
				   |	ВТ_ПрерасчетМинимальногоЗначения КАК ВТ_ПрерасчетМинимальногоЗначения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПрохожденияНормативов КАК ОценкиПрохожденияНормативов
				   |		ПО ВТ_ПрерасчетМинимальногоЗначения.МеждународнаяВозрастнаяГруппа = ОценкиПрохожденияНормативов.МеждународнаяВозрастнаяГруппа
				   |			И ВТ_ПрерасчетМинимальногоЗначения.Пол = ОценкиПрохожденияНормативов.Пол
				   |			И ВТ_ПрерасчетМинимальногоЗначения.Норматив = ОценкиПрохожденияНормативов.Норматив
				   |			И ВТ_ПрерасчетМинимальногоЗначения.РезультатМакс = ОценкиПрохожденияНормативов.РезультатЧисло
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.МеждународнаяВозрастнаяГруппа,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Пол,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Норматив,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.РезультатМакс,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.РезультатМин,
				   |	ВТ_ШкалаПрисвоенияБалловПредитог.Балл
				   |ИЗ
				   |	ВТ_ШкалаПрисвоенияБалловПредитог КАК ВТ_ШкалаПрисвоенияБалловПредитог
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	МеждународнаяВозрастнаяГруппа,
				   |	Пол,
				   |	Норматив
				   |
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	вт_ТаблицаДанных.Индекс КАК Индекс,
				   |	ОценкиПрохожденияНормативов.Балл КАК Балл
				   |ИЗ
				   |	вт_ТаблицаДанных КАК вт_ТаблицаДанных
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПрохожденияНормативов КАК ОценкиПрохожденияНормативов
				   |		ПО вт_ТаблицаДанных.МеждународнаяВозрастнаяГруппа = ОценкиПрохожденияНормативов.МеждународнаяВозрастнаяГруппа
				   |			И вт_ТаблицаДанных.Пол = ОценкиПрохожденияНормативов.Пол
	               |			И вт_ТаблицаДанных.Норматив = ОценкиПрохожденияНормативов.Норматив
	               |			И вт_ТаблицаДанных.РезультатБулево = ОценкиПрохожденияНормативов.РезультатБулево
	               |ГДЕ
	               |	вт_ТаблицаДанных.ТипРезультата = ЗНАЧЕНИЕ(перечисление.ТипыРезультатов.булево)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вт_ТаблицаДанных.Индекс,
	               |	ВТ_ШкалаПрисвоенияБалловИтог.Балл
	               |ИЗ
	               |	вт_ТаблицаДанных КАК вт_ТаблицаДанных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШкалаПрисвоенияБалловИтог КАК ВТ_ШкалаПрисвоенияБалловИтог
	               |		ПО вт_ТаблицаДанных.МеждународнаяВозрастнаяГруппа = ВТ_ШкалаПрисвоенияБалловИтог.МеждународнаяВозрастнаяГруппа
	               |			И вт_ТаблицаДанных.Пол = ВТ_ШкалаПрисвоенияБалловИтог.Пол
	               |			И вт_ТаблицаДанных.Норматив = ВТ_ШкалаПрисвоенияБалловИтог.Норматив
	               |ГДЕ
	               |	(вт_ТаблицаДанных.РезультатЧисло >= ВТ_ШкалаПрисвоенияБалловИтог.РезультатМин
	               |			И вт_ТаблицаДанных.РезультатЧисло < ВТ_ШкалаПрисвоенияБалловИтог.РезультатМакс)
				   |    И вт_ТаблицаДанных.РезультатЧисло <> 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоставУчастников[Выборка.Индекс].Баллы = Выборка.Балл;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
